<?php 

// 直接赋值
// 索引
$a[] = 10;
$a[5] = '呵呵哒';

// 关联
$b['app1'] = '微信';
$b['app2'] = '抖音';
var_dump($a, $b);


// 使用array() 语言结构来声明
// 未指定下标的方式
$c = array(2, 250, 249, 388, '合法的', true);
//指定下标的方式(又分为索引数组指定和关联数组指定)

//指定索引数组
$d = array(
	3 => '10',
	6 => '100',
	9 => '1000',
);

//指定关联数组
$e = array(
	'app1' => '抖音',
	'app2' => '陌陌',
	'app3' => '探探',




);


// 短数组语法
// 用[]替代array()这种语言结构
// 索引
	$f = [1,2,3,4,5,6];
	$f = ['1','2','3','四','五'];

// 关联
	$g = [
		'phone1' => '华为',
		'phone2' => '一加',
		'phone3' => '锤子'

	];







// 使用 php函数 得到一个数组


/*
range()  生成指定范围的数组
	参1 指定范围序列开始的值
	参2 序列的结束的值
	参3 可选参数,步长
 */

$h = range(0,9);
var_dump($h);
// ASCII码
$o = range('', 'Z');
$k = range('', 'z');
var_dump($o, $k);

/*
array_fill()	用指定的值 来填充数组
	参1 开始的索引值
	参2 插入的元素数量
	参3 用来填充的值



 */

$p = array_fill(0, 7, 'DDS');
var_dump($p);









