<?php 
// 后向引用
// 后面的引用前面的内容
$str = '2019-03-19';

$preg = '/\d{4}-\d{2}-\d{2}/';
$preg = '/\d{4}(-)\d{2}(-)\d{2}/';
preg_match_all($preg, $str, $result);
var_dump($result);



// 过滤
// preg_grep(正则，数组)
// 将数组经过正则匹配，留下符合正则的数组
$time = [
			'2019-03-19',
			'2019/03/19',
			'2019.03.19',
			'2019.03-19',
			'2019.03/19',
			'2019?03-19',
			'2019+03-19',
			'2019+03*19',
		];

$preg = '/\d{4}  [-\/\.]  \d{2}   [-\/\.]  \d{2}/x'; # x能消除所有的空白


$preg = '/\d{4}  ([-\/\.])  \d{2}   \1  \d{2}/x'; # x能消除所有的空白

$res = preg_grep($preg, $time);
var_dump($res);



// 后向引用
// 后面的引用前面的内容
// \1	将第一个()的值 重复到 \1的位置
// \2	将第二个()的值 重复到 \2的位置
// ....
// \num 将第num个()的值 重复到 \num的位置


// () 子模式
// 小括号两个功能 
// 		1) 子模式,会参与子模式匹配
// 		2) 将多个原子当成一个整体

// 取消子模式的写法
// (?:)在小括号里面的最前面









 ?>